/*
 *  Copyright © 2020年 WuSong. All rights reserved.
 *
 *  @author: GodlikeLPC
 *  @create: 2020-08-27
 *  @update: 
*/

/// 隐私协议文本
class WSPrivacyAgreementContent {
  static get title {
    return '个人信息及隐私保护政策';
  }

  static get content {
    return '''
提示条款

1.您的信任对我们非常重要，我们深知个人信息对您的重要性，我们将按法律法规要求，采取相应安全保护措施尽力保护您的个人信息安全可控。有鉴于此，无讼平台产品和服务提供者（下称“无讼”或“我们”）制定本《个人信息及隐私保护政策》（下称“本政策”）并提醒您：

2. 本政策适用于无讼提供的所有平台产品及服务，包括无讼网站、无讼APP、无讼客户端、软件及微信公众号。

3. 本政策不适用于其他任何第三方通过前述网站、APP、客户端、软件或微信公众号向您提供的产品及服务。我们建议您在使用该等第三方提供的产品及服务前查看其个人信息及隐私保护政策，以了解他们如何处理您的信息。对于您使用第三方产品及服务时，向其提供或与他人分享个人信息而产生的全部后果均由您自行承担。

4. 在使用无讼平台产品或服务前，请您务必仔细阅读并透彻理解本政策全部内容，特别是以粗体或粗体下划线标示的条款，在确认充分理解并同意后再使用相关产品及服务。一旦您开始使用无讼平台产品及服务，即表示您已充分理解并同意本政策。

第一部分定义

1.无讼平台产品及服务：是指无讼网站（域名为：itslaw.com、wusong.com）、移动终端程序（包含无讼App、无讼智能法务）、客户端、软件和微信公众号。

2.无讼平台产品及服务提供者：是指研发并提供无讼平台产品和服务的无讼网络科技（北京）有限公司。

3.个人信息：是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。

4.个人敏感信息：是指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下（含）未成年人的个人信息。

5.个人信息删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。

除另有约定外，本政策所使用定义与无讼平台用户服务协议中的定义具有相同的含义。

第二部分 隐私政策

本政策部分将帮助您了解以下内容：
一、我们如何收集和使用您的个人信息
二、我们如何使用Cookie和同类技术
三、我们如何共享、转让、公开披露您的个人信息
四、我们如何保护您的个人信息
五、您如何管理您的个人信息
六、我们如何处理未成年人的个人信息
七、您的个人信息如何在全球范围转移
八、本政策如何更新
九、如何联系我们

一、我们如何收集和使用您的个人信息

在您使用我们的产品及服务时，我们需要收集和使用的您的个人信息包括如下两种：
1、为实现向您提供我们产品及服务的基本功能，您须授权我们收集和使用的必要信息。如您拒绝提供相应信息，您将无法正常使用我们的产品及服务；
2、为实现向您提供我们产品及服务的附加功能，您可选择授权我们收集、使用的信息。如您拒绝提供，您将无法正常使用相关附加功能或无法达到我们拟达到的功能效果，但并不会影响您正常使用我们产品及服务的基本功能。
您理解并同意：
1、我们始终致力于打造多样化的产品及服务以满足您的需求。因不同用户选择使用的具体产品及服务范围存在差异，随之而来的，基本功能和附加功能及收集使用的个人信息类型、范围等会有所区别，请以具体的产品及服务功能为准；
2、为给您带来更好的产品和服务体验，我们一直在努力改进我们的技术，后续我们可能会不时推出新功能或优化后的功能，相应的，我们可能需要收集和使用新的个人信息或变更个人信息的使用目的或方式。对此，我们将通过更新本政策、页面提示、向您指定的邮箱地址发送邮件或向您注册的手机号码发送短信息等方式另行说明，同时为您提供自主选择同意的方式，并在征得您明示同意后进行收集和使用。

我们会为实现本政策的下述各项功能，收集和使用您的个人信息：
（一） 帮助您成为我们的注册用户
1、账号服务
为注册成为无讼平台的用户以使用我们的产品及服务，您需要提供手机号码或邮箱地址、拟使用的密码用于创建无讼平台账户。我们可能会根据您提供的上述手机号码或邮箱地址校验您的身份，以确保我们是在为您本人提供服务。  
2、认证服务
如果您选择提供真实姓名、所在地、执业/职业信息、头像等非注册所必须的个人信息，我们可以为您提供认证用户等更加个性化的账号服务。其中，为保证您与我们平台其他用户之间交易的安全性或证实您的执业/职业经历，您的姓名、头像将公开显示。
3、授权登录
我们可能在经您同意后向第三方共享您的账户信息（头像、昵称及其他页面提示的信息），使您可以便捷地实现第三方账户的注册或登录。此外，我们可能会根据您的授权从第三方处获取您的第三方账户信息，并与您的无讼平台账户进行绑定，使您可通过第三方账户直接登录、使用我们的产品及服务。我们将在您授权同意的范围内使用您的相关信息。

（二） 为您提供产品或服务信息展示
在您使用我们产品及服务的过程中，为识别账号异常状态、了解产品及服务的适配性、向您提供更契合您需求的页面展示和搜索结果，我们可能会自动收集您的使用情况并存储为网络日志信息，包括：
1、设备信息
我们会根据您在软件安装及使用中的具体操作，接收并记录您所使用的设备相关信息（包括设备型号、操作系统版本、设备设置、唯一设备标识符、设备环境、移动应用列表等软硬件特征信息）、设备所在位置相关信息（包括您授权的GPS位置以及WLAN接入点、蓝牙和基站等传感器信息）。
2、服务日志信息
当您使用我们的网站、APP或客户端等提供的服务时，我们会自动收集您对我们服务的详细使用情况，作为服务日志保存，包括浏览、点击查看、搜索查询、关注、分享、发布信息，以及IP地址、浏览器类型、电信运营商、使用语言、访问日期和时间。
请注意，单独的设备信息、服务日志信息均是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息相结合用于识别特定自然人身份，或者将其与个人信息相结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将这类信息做匿名化、去标识化处理。
为向您提供更便捷、更符合您个性化需求的信息搜索、展示及推送服务，我们会根据您的设备信息和您使用无讼网站、APP或客户端等时的搜索、浏览信息，提取您的偏好特征，并基于特征标签制作间接人群画像，用于展示、推送信息和可能的商业广告。
我们努力保障您的使用体验。我们向您推送服务通知基于您对产品或服务内容的主动订阅/关注行为，一旦您不想接收我们给您发送的服务通知，您需取消对产品或服务内容的订阅/关注。请您知悉，您取消某项服务通知将直接导致您无法继续使用我们的该项产品或服务。[根据产品经理的反馈增加]
我们向您发送商业广告基于您在账号设置中的主动勾选，一旦您不想接收我们给您发送的商业广告，您可通过账号设置中取消勾选的方式进行退订或关闭。请您知悉，为尽可能减少与您无关的信息对您造成的打扰，我们一直在改进和优化内容推荐机制。
此外，我们也会为了不断改进和优化上述功能来使用您的上述信息。

（三）帮助您完成服务交易
当您在使用我们的合作、请教服务时，我们收集的信息将依据您的身份而有所区别。如您为需求发起者，您需至少提供您需解决的问题内容，您的联系方式，同时该项需求中会载明您服务需求的创建时间、您应支付的服务金额；如您为服务提供者，您需至少提供您的服务内容，您的联系方式。我们收集这些信息是为了帮助您顺利完成服务交易、保障您的交易安全、查询交易信息、提供客服与售后服务及其他我们明确告知的目的。
您可以通过无讼为其他人发布合作、请教服务的需求，您需要提供该实际需求人的前述个人信息。
请您注意，您公开发布的合作、请教需求描述中可能会涉及您或他人的个人信息甚至个人敏感信息，因此请您谨慎地考虑是否在使用我们的该项服务时共享甚至公开分享相关信息。
 
（四） 帮助您完成支付 
为完成服务费用支付或收取，您需要提供微信账户，我们会将您的无讼平台账户会员名、对应的微信账号、交易支付相关信息、交易安全相关设备信息及其他反洗钱法律法规要求的必要信息通过在网站或应用程序中嵌入的微信软件工具开发包（软件工具开发包在本政策中简称“SDK”）等方式与腾讯公司共享。
为使我们及时获悉并确认您的支付进度及状态，为您提供交易争议解决服务，您同意我们可自您所选择的交易对象、腾讯公司处收集与支付进度相关的信息。

（五）客服及争议处理
当您与我们联系或提出争议纠纷处理申请时，为了保障您的账户及系统安全，我们需要您提供必要的个人信息以核验您的用户身份。
为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果，我们可能会保存您与我们的通讯或通话记录及相关内容（包括账号信息、交易信息、您为了证明相关事实提供的其他信息，或您留下的联系信息），如果您针对某项具体服务进行咨询、投诉或提供建议的，我们会使用您的账号信息和交易信息。
为了提供服务和改进服务质量的合理需要，我们还可能使用的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们提供的问卷答复信息。

（六）为您提供安全保障
为提高您使用我们及我们合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或无讼相关协议规则的情况，我们在应用程序中嵌入我们开发的应用安全SDK收集您的设备信息、服务日志信息，并可能使用或整合您的注册信息、交易信息、设备信息、服务日志信息以及我们合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。
 
（七）为您提供其他附加服务
为向您提供更便捷、更优质、个性化的产品及服务，努力提升您的体验，我们在向您提供的以下附加服务中可能会收集和使用您的个人信息。如果您不提供这些信息，不会影响您使用浏览、搜索等基本服务，但您可能无法获得这些附加服务给您带来的用户体验。这些附加服务包括：
1、基于位置信息的个性化推荐服务：我们会在您开启位置权限后访问获取您的位置信息，根据您的位置信息为您提供更契合您需求的页面展示、产品及服务。
2、基于相机/摄像头的附加服务：您可在开启相机/摄像头权限后使用该功能拍摄二维码用于线下课程签到 。请您知悉，即使您已同意开启相机/摄像头权限，我们也仅会在您主动点击客户端内相机图标时通过相机获取照片信息。
3、基于相册的图片访问及上传的附加服务：您可在开启相册权限后使用该功能上传您的照片/图片，以实现更换头像、发布信息等功能。
4、基于日历的附加服务：在您开启我们可读取/写入您日历的权限后，我们将收集您的日历信息用于向您提供案件管理的相关记录及提醒。
5、基于手机状态的附加服务：为保障您的账号与使用安全，您需要授权我们读取本机识别码。
您理解并同意，上述附加服务可能需要您在您的设备中开启您的位置信息/地理位置、相机/摄像头、相册、日历及手机状态的访问权限，以实现这些权限所涉及信息的收集和使用。您可在您的设备设置中逐项查看上述权限的状态，并可自行决定这些权限随时的开启或关闭。请您注意，您开启任一权限即代表您授权我们可以收集和使用相关个人信息来为您提供相应服务，您一旦关闭任一权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的信息收集及使用。
 
（八）其他
1、若你提供的信息中含有其他用户的个人信息，在向无讼提供这些个人信息之前，您需确保您已经取得合法的授权。若其中涉及未成年人个人信息的，您需在发布前取得对应未成年人监护人的同意，前述情形下监护人有权通过本政策第九条的途径联系我们，要求更正或删除涉及未成年人个人信息的内容。
2、若我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的，或者我们主动从第三方处获取您的个人信息，均会事先获得您的同意。
若我们从第三方处间接获取您的个人信息的，我们会在收集前明确以书面形式要求该第三方在已依法取得您同意后收集，并向您告知获取的信息内容，且涉及敏感信息的在提供给我们使用前需经过您的明确同意，要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求对方承担相应法律责任；同时，我们的专业安全团队对个人信息会进行安全加固（包括敏感信息报备、敏感信息加密存储、访问权限控制等）。我们承诺并会使用以不低于我们对自身用户个人信息同等的保护手段与措施对该等间接获取的个人信息进行保护。
3、征得授权同意的例外
您充分理解并同意，我们在以下情况下收集、使用您的个人信息无需取得您的授权同意，且我们可能不会响应您提出的更正/修改、删除、注销、撤回同意、索取信息的请求：
（1）与国家安全、国防安全有关的；
（2）与公共安全、公共卫生、重大公共利益有关的；
（3）与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；
（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
（5）您自行向社会公众公开的个人信息；
（6）从合法公开披露的信息渠道中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
（7）根据与您签订和履行相关协议或其他书面文件所必需的；
（8）用于维护所提供的产品及服务的安全稳定运行所必需的，例如发现、处置产品及服务的故障；
（9）为合法的新闻报道所必需的；
（10）学术研究机构基于公共利益开展统计或学术研究所必需，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化或匿名化处理的；
（11）法律法规规定的其他情形。
请您理解，根据相关法律，若我们对您的个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，或我们可能会对收集的信息进行去标识化地研究、统计分析和预测，用于改善无讼的内容和布局，为商业决策提供产品或服务支撑，以及改进我们的产品和服务（包括使用匿名化数据进行机器学习或模型算法训练），则此类处理后数据的使用无需另行向您通知并征得您的同意。
4、如我们停止运营无讼产品或服务，我们将及时停止继续收集您个人信息的活动，并将停止运营的通知以逐一送达或公告的形式通知您，并对我们所持有的与已关停业务相关的个人信息进行删除或匿名化处理。涉及未成年人的个人信息的，我们会并将停止运营的通知及时告知其监护人。
 
二、我们如何使用Cookie和同类技术

（一）Cookie
为确保网站正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储Cookie、Flash Cookie，或浏览器（或关联应用程序）提供的其他通常包含标识符、站点名称以及一些号码和字符的本地存储（统称“Cookie”）。借助于 Cookie，网站能够存储您的偏好等数据。
如果您的浏览器或浏览器附加服务允许，您可修改对Cookie的接受程度或拒绝我们的Cookie。有关详情，请参见 AboutCookies.org。但如果您这么做，在某些情况下可能会影响您安全访问我们的网站，且可能需要在每一次访问我们的网站时更改用户设置。

（二）Cookie同类技术
除 Cookie外，我们还会在网站上使用网站信标、像素标签、ETag等其他同类技术。
例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品及服务偏好，以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
ETag（实体标签）是在互联网浏览器与互联网服务器之间背后传送的HTTP协议标头，可代替Cookie。ETag可以帮助我们避免不必要的服务器负载，提高服务效率，节省资源、能源，同时，我们可能通过ETag来记录您的身份，以便我们可以更深入地了解和改善我们的产品及服务。大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。但请注意，如果停用ETag，您可能无法享受相对更佳的产品及服务体验。
 
三、我们如何共享、转让、公开披露您的信息

（一）共享
我们不会与无讼以外的公司、组织和个人共享您的个人信息，但以下情况除外：
1、在法定情形下的共享：我们可能会根据法律法规规定、诉讼、争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。
2、在获取明确同意情形下的共享：在已获得您的明确同意后，我们会与其他方共享您的个人信息。
3、在您主动选择情形下的共享：您通过无讼平台购买服务，我们会根据您的选择，将您交易信息中的有关必要信息共享给相关服务的提供者，以实现您的交易及服务需求。
4、与授权的合作伙伴共享：我们可能委托授权合作伙伴为您提供某些服务或代表我们履行某些职能，我们仅会出于本隐私权政策声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其提供服务或履行职责所必需的信息，且不得将此信息用于其他任何目的。对于涉及未成年人的个人信息的，我们明确不允许合作伙伴进行转委托。
目前，我们的授权合作伙伴包括以下类型：
（1）广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息与提供广告、分析服务的合作伙伴共享。我们会委托这些合作伙伴处理与广告覆盖面和有效性相关的信息，但不会提供您的个人身份信息，或者我们将这些信息进行去标识化处理，以便它不会识别您个人。这类合作伙伴可能将上述信息与他们合法获取的其他数据相结合，以执行我们委托的广告服务或分析决策建议。
（2）供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括受我们委托提供的技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。
为了使您能够使用上述服务及功能，我们的应用中会嵌入授权合作伙伴的SDK或其他类似的应用程序。如在您使用向微信朋友或微信朋友圈分享信息功能时，相关SDK会收集您的设备识别号、联网相关信息。
我们会对授权合作伙伴获取有关信息的应用程序接口（API）、软件工具开发包（SDK）进行严格的安全检测，并与授权合作伙伴约定严格的数据保护措施，令其按照我们的委托目的、服务说明、本隐私权政策以及其他任何相关的保密和安全措施来处理个人信息。

（二）转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
2、在无讼平台服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。

（三）公开披露
我们仅会在以下情况下，公开披露您的个人信息：
1、获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；
2、如我们确认您出现违反法律法规或严重违反无讼平台相关协议及规则的情况，或为保护无讼平台用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及无讼平台已对您采取的措施。例如，若您因提供受托服务而侵犯委托人的合法权益，我们可能会向该被侵权人公开披露您的联系方式。

（四）共享、转让、公开披露个人信息时事先征得授权同意的例外
以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
1、与国家安全、国防安全有关的；
2、与公共安全、公共卫生、重大公共利益有关的；
3、与犯罪侦查、起诉、审判和判决执行等司法活动或行政执法活动有关的；
4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
5、您自行向社会公众公开的个人信息；
6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
请您理解，根据有关法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。
 
 四、我们如何保护您的信息
（一）我们已采取符合业界标准、合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。例如，在您的浏览器与服务器之间交换数据时受 SSL协议加密保护；我们同时对无讼网站提供HTTPS协议安全浏览方式；我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
我们对可能接触到未成年人个人信息的工作人员采取最小够用授权原则，并采取技术措施对工作人员处理未成年人的个人信息的行为进行记录和管控，避免违法复制、下载未成年人的个人信息。
（二）我们有行业先进的以数据为核心、围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。目前，我们的重要信息系统已经通过公安部网络安全等级保护【3】级测评与网路安全机构的渗透测试。
（三）我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非法律有强制性的保存要求，例如《中华人民共和国电子商务法》要求商品和服务信息、交易信息保存时间自交易完成之日起不少于三年。而我们判断前述期限的标准包括：
1、完成与您相关的交易目的、维护相应交易及业务记录、应对您可能的查询或投诉；
2、保证我们为您提供服务的安全和质量；
3、您是否同意更长的保留期间；
4、是否存在保留期限的其他特别约定。
在您的个人信息超出保留期间后，我们会根据相关法律的要求删除您的个人信息，或使其匿名化。
（四）互联网并非绝对安全的环境，使用无讼平台服务时，我们强烈建议您不要使用非无讼平台推荐的通信方式发送您的信息。您可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、交易或分享时，您可以自主选择沟通、交易或分享的对象，作为能够看到您的交易内容、联络方式、交流信息或分享内容等相关信息的第三方。
在使用无讼服务进行网上交易时，您不可避免地要向交易相对方或潜在的交易相对方披露自己的个人信息，如联络方式或联系地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即联络无讼客服，以便我们根据您的申请采取相应措施。
请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。
请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
（五）我们将不定期更新并公开安全风险、个人信息安全影响评估报告等有关内容，您可通过无讼公告方式获得。
（六）在不幸发生个人信息安全事件后，我们将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。
 
五、您如何管理您的信息

您可以通过以下方式访问及管理您的信息：

（一）查询、更正和补充您的信息
您有权查询、更正或补充您的信息。您可以通过以下方式自行进行：
1、登录无讼网站，进入您的用户账号，点击“我的设置”，您可查询、自行更正个人资料及个人账户相关信息；
2、登录无讼网站并点击网站首页下方的“联系我们”，可在线寻求客服帮助；或在工作时间内，通过联系无讼网站首页下方公示的客服电话：400-010-5353，我们的客服将协助您查询、更正或补充您的信息。

（二）删除您的信息
您可以通过“（一）查询、更正和补充您的信息”中列明的方式删除您的部分信息。
在以下情形中，您可以向我们提出删除个人信息的请求：
1、如果我们处理个人信息的行为违反法律法规；
2、如果我们收集、使用您的个人信息，却未征得您的明确同意；
3、如果我们处理个人信息的行为严重违反了与您的约定；
4、如果您不再使用我们的产品或服务；
5、如果我们永久不再为您提供产品或服务。
若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，并要求其及时删除（除非法律法规另有规定，或这些主体已独立获得您的授权）。
当您或我们协助您删除相关信息后，因为适用的法律和安全技术，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并将其与任何进一步处理隔离，直到备份可以清除或实现匿名化。

（三）改变您授权同意的范围
每个业务功能需要一些基本的个人信息才能得以完成（见本隐私权政策“第一部分”）。除此之外，您可以在与无讼客服联系或改变您的智能移动设备的设置等方式给予或收回您的授权同意。
当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。而且，一旦您不再给予或收回您对某项基本功能所必需信息的授权同意，那么您也将无法继续继续使用该项基本功能。[根据产品经理的反馈内容增加]

（四）注销您的账户
您可以通过以下方式申请注销您的账户：
拨打无讼网站首页下方公示的客服电话：400-010-5353
在您主动注销账户之后，我们将停止为您提供产品或服务，根据适用法律的要求删除您的个人信息或使其匿名化。

（五）约束信息系统自动决策
在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害无讼商业秘密或其他用户权益、社会公共利益的前提下提供申诉方法。

（六）响应您的上述请求
为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
我们将在15个工作日内做出答复。如您不满意，还可以通过无讼客服发起投诉。
对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将酌情收取一定费用。对于与您的身份不直接关联的信息、无端重复信息，或者需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者不切实际的请求，我们可能会予以拒绝。
在以下情形中，按照法律法规要求，我们将无法响应您的请求：
1、与国家安全、国防安全有关的；
2、与公共安全、公共卫生、重大公共利益有关的；
3、与犯罪侦查、起诉、审判和执行判决等有关的；
4、有充分证据表明个人信息主体存在主观恶意或滥用权利的；
5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
6、涉及商业秘密的。
 
六、我们如何处理未成年人的信息
在电子商务活动中我们推定您具有相应的民事行为能力。由于提供产品及服务的特殊性，我们不推荐未成年人使用我们的平台产品及服务。如果我们识别出您是未成年人用户的，我们将通知您的监护人并要求您的监护人明确同意未成年人个人信息收集使用规则。对于经父母或其他监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或其他监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露该等信息。
 
七、您的信息如何在全球范围转移
我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，以下情形除外：
1、适用的法律有明确规定；
2、获得您的明确授权；
3、您通过互联网进行跨境交易等个人主动行为。
针对以上情形，我们会确保依据本隐私权政策对您的个人信息提供足够的保护。
 
八、本政策如何更新
我们的个人信息及隐私保护政策可能变更。
未经您明确同意，我们不会限制您按照本政策所应享有的权利。我们会告知您对本政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知（包括我们会通过无讼公示的方式进行通知甚至向您提供弹窗提示）。
本政策所指的重大变更包括但不限于：
1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
2、我们在控制权等方面发生重大变化。如并购重组等引起的信息控制者变更等；
3、个人信息共享、转让或公开披露的主要对象发生变化；
4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化；
6、个人信息安全影响评估报告表明存在高风险。
 
九、如何联系我们
如果您对无讼平台的隐私保护政策或数据处理有任何疑问、意见或建议，可以通过以下方式与我们联系，我们将在15个工作日内回复您：
客服电话：400-010-5353(工作日：09:00-18:00) 
联系地址：中国北京市东城区南河沿大街南湾子16号(100006) 
如果您对我们的回复内容不满意，尤其是如您认为我们的个人信息处理行为损害了您的合法权益，您还可以通过向被告住所地有管辖权的法院提起诉讼来寻求解决。
''';
  }
}
