/*
 *  Copyright © 2020年 WuSong. All rights reserved.
 *
 *  @author: GodlikeLPC
 *  @create: 2020-08-27
 *  @update: 
*/

/// 平台服务协议文本
class WSPlatformServiceAgreementContent {
  static get title {
    return '无讼平台服务协议';
  }

  static get content {
    return '''
'\n欢迎您注册、使用无讼诉讼管理平台。\n'
      '\n无讼诉讼管理平台是由无讼网络科技（北京）有限公司 （以下简称“无讼”）开发并运营的诉讼案件管理系统， 在为律师用户提供专业可靠的案件流程管理、多 人案件 协同的办案工具的同时也会对接需求方更好的展现律师 的专 业能力，为律师用户提供更多的案源机会。\n'
      '\n请您仔细阅读下列条款（特别是以粗体并下划线标识的 条款， 因为这些条款可能会明确您应履行的义务或对您 的权利有所限制）。 您选择成为无讼诉讼管理平台认证 律师，将意味着您完全接受本服务规则的全部内容。\n'
      '\n\n一、使用规则\n'
      '\n1.1 您在无讼诉讼管理平台注册成功后，将拥有自己的 系统账户。 如需进一步使用无讼诉讼管理平台的功能模 块， 您则需要对账户信息进行完善，并进行律师身份认 证。 认证完毕后您可享有个人能力曝光、在线实时沟通 、线上案件协作三项特权。\n'
      '\n1.2进行律师身份认证，您需要填写真实姓名、 执业证 号、执业律所、职务，并上传执业证照片及手持身份证 照片（选填）。 您需确保所填个人信息完整、准确。\n'
      '\n1.3 您应确保您在无讼诉讼管理平台提交的信息（包括 但不限于个人基本信息，教育、工作经历信息， 荣誉及 其他履历信息）的真实性、合法性及有效性。您不得使 用虚假信息进行认证； 不得冒充他人名义认证律师身份 ；不得恶意使用注册帐号导致其他用户误认； 否则无讼 有权立即停止提供服务，并注销您的系统帐号。您有上 述行为的，应自行承担由此而产生的一切法律后果。\n'
      '\n1.4 您同意无讼使用您提交的信息，进行数据统计、分 析。无讼基于上述信息 及数据为具体专项法律服务需求 方进行律师推荐。\n'
      '\n\n二、认证用户的权利与义务\n'
      '\n2.1认证后，您可以获得在无讼诉讼管理平台需求端进 行律师信息曝光及展示的机会， 但信息的曝光及展示不 必然为您带来直接的经济利益。\n'
      '\n2.2认证后，您可以接收来自无讼诉讼管理平台需求端 的法律服务需求， 包括但不限于案件协同需求、线上咨 询服务需求等。您接收到需求后， 可以与需求端客户进 行磋商，无讼不对双方的磋商结果负责。\n'
      '\n2.3认证后，您与来自无讼诉讼管理平台需求端客户磋 商达成一致， 确定合作或委托关系的，您应本着诚实信 用原则履行义务， 如有故意或过失损害需求端客户的情 形应承担相应的法律责任，无讼不承担由此可能产生的 任何责任。\n'
      '\n2.4 您不得以任何方式利用无讼诉讼管理平台直接或间 接从事违反中国法律、法规、公序良俗的行为。 无讼有 权随时对违反上述承诺的内容予以删除\n'
      '\n2.5 您不得上传国家法律明令禁止的非法文件， 包括但 不限于图片、视频、文档、文字等。无讼有权随时对违 反上述承诺的内容予以删除， 由此出现的任何法律后果 的由您自行承担。\n'
      '\n2.6 无讼有权对您使用的情况进行审查和监督，如您在 使用无讼诉讼管理平台时违反任何上述规定， 无讼有权 要求您改正或直接采取一切必要的措施（包括但不限于 赔偿损失、 暂停或终止您使用无讼诉讼管理平台的权利 ）以减轻因您不当行为造成的影响。\n'
      '\n2.7 无讼作为无讼诉讼管理平台运营方，仅将您的认证 信息作为资格认证时的辅助材料使用， 并将通过技术手 段等充分保护您的个人信息。 除法律或有法律赋予权限 的政府部门要求或事先得到您的明确授权等原因外， 无 讼保证不对外公开或向第三方透露您的个人信息。\n'
      '\n\n三、服务条款修改\n'
      '\n3.1 根据有关法律、法规及规范性文件的变化，或者因 业务发展需要， 无讼有权对本协议的条款作出修改或变 更，一旦本协议的内容发生变动， 无讼将会直接在无讼 诉讼管理平台上公布修改之后的协议内容， 该公布行为 视为无讼已经通知您修改内容。无讼也可通过您已指定 电子邮件等其他方式， 提示您本规则的修改或其它重要 事项。\n'
      '\n3.2 如果您不同意无讼对本协议相关条款所做的修改， 则有权并应当停止使用无讼诉讼管理平台。如果您选择 继续使用， 则视为您接受无讼对本协议相关条款所做的 修改。\n'
      '\n\n四、争议解决\n'
      '\n4.1本协议的订立、执行、解释及发生相关的所有纠纷、 争议的解决适用中国法律。\n'
      '\n4.2 因本协议发生任何纠纷，双方应尽力协商一致解决 ； 协商不成的，双方同意提交北京仲裁委员会仲裁。'
    ''';
  }
}
